[
    {
        "name": "Sonic the Hedgehog in Chilli Dog Zone",
        "description": "Sonic the Hedgehog tells Commander Keen to have a chilli dog but finds out he doesn't know what they are, so they go to Chilli Dog Zone.",
        "date": "2023-07-03",
        "src": "comic1.png",
        "tooltip": "Sonk 3"
    },
    {
        "name": "Gotta Grow Pasta",
        "description": "Knuckles the Echidna tries to punch Sonic but it doesn't work because he's too fast, so he grows pasta.",
        "date": "2023-07-04",
        "src": "comic2.png",
        "tooltip": "BBC pasta woman"
    },
    {
        "name": "Alex Kidd's Whacky Wheelie Adventure",
        "description": "Alex Kidd drives a car and it's whacky and wheelie.",
        "date": "2023-07-04",
        "src": "comic3.png",
        "tooltip": "Read Alex Kidd Buys Heroin"
    },
    {
        "name": "Guybrush Threepwood and the Ordinary Rubber Chicken With a Pulley in the Middle of Th eK",
        "description": "Guybrush Threepwood finds a perfectly normal rurbber chicken with a pulley in the middle. OR DOES HE? (He does.) Oh, and there's a monkey. And a pirate. named LeChuck. And a ghost. nee nee noo noo",
        "date": "2023-07-06",
        "src": "comic4.png",
        "tooltip": "Guybrush Th eK Threepwood w o w"
    },
    {
        "name": "Mario and Luigi Drink England Juice",
        "description": "I'm here to make ironic sprite comics and drink England juice, and I'm all out of England juice.",
        "date": "2023-07-06",
        "src": "comic5.png",
        "tooltip": "Bowser: Ha ha ha ha ha ha"
    },
    {
        "name": "Hewligg Urobokkle and the Mysterious Case of the Missing Pencil",
        "description": "Hewligg Urobokkle is a detective and he's trying to find a pencil but he can't find it because it's missing.",
        "date": "2023-07-06",
        "src": "comic6.png",
        "tooltip": "Hewligg Urobokkle was a sprite comic I made when I was about 12. This is a remake of the first comic."
    },
    {
        "name": "Inspected Gadget and Kuzco the Emperor's New Groove Ride a Rollercoaster",
        "description": "Inspected Gadget and Kuzco the Emperor's New Groove ride a rollercoaster and they DO NOT die. They are both very happy.",
        "date": "2023-07-08",
        "src": "comic7.png",
        "tooltip": "Wow Kuzco is so happy and he's not dead"
    },
    {
        "name": "Commander Keen 3 Keen Must Die True Ending",
        "description": "The Vorticons are dead and Commander Keen is happy. He is also a bit sad because he killed them.",
        "date": "2023-07-09",
        "src": "comic8.png",
        "tooltip": "Cooking Mama 2: Dinner with Friends"
    },
    {
        "name": "Drunk Bush and the Mystery of the Missing Beer",
        "description": "A drunk George Bush is trying to find his beer but it's missing. He is very sad. Birdo is also there. She is also very sad.",
        "date": "2023-07-13",
        "src": "comic9.png",
        "tooltip": "Birbo is sad because she can't find her beer either but she doesn't know that yet"
    },
    {
        "name": "Fry Day",
        "description": "Mario's head from Mario Teaches Typing 2 tries to kill Bowser but Somersault Guy from Impossible Mission for the Commodore 64 stops him.",
        "date": "2023-07-18",
        "src": "comic10.png",
        "tooltip": "Cooking Mama makes a cameo appearance in this comic but she doesn't do anything"
    },
    {
        "name": "Batman Giraffe and the Mystery of the Missing Giraffe Suit",
        "description": "Batman is on a giraffe mission but he can't find his giraffe suit. He is also a giraffe.",
        "date": "2023-07-21",
        "src": "comic11.png",
        "tooltip": "Batman is not actually a giraffe but he is wearing a giraffe suit. He is also a giraffe."
    },
    {
        "name": "Garfield Has a Zany Existential Crisis and Dies and Goes to Hell and Gets Eaten by a Demon and Dies Again and",
        "description": "Garfield has had enough of his mundane lasgne life and decides to kill himself. He goes to hell and gets eaten by a demon and that kills him again. He is very dead. None of that actually happens in this comic though.",
        "date": "2023-07-22",
        "src": "comic12.png",
        "tooltip": "Life is not pain it is lasagne and lasagne is pain but also life and not forgetting lasagne which is also life and pain"
    },
    {
        "name": "Disco Chicken Visits the Disco",
        "description": "Disco Chicken is a chicken and he likes disco. He goes to the disco and dances. Wallace from Wallace and Gromit is there. Rayman is bad at dancing so he is executed.",
        "date": "2023-07-30",
        "src": "comic13.png",
        "tooltip": "Why is Wallace from Wallace and Gromit at the disco? Nobody knows. Also colour a dinosaur is a real game. Hello."
    },
    {
        "name": "Gear Gringers",
        "description": "Gear Gringers is a game about gringing gears. It is a very good game and you should play it. Spyro the Dragon is a dragon and he is also a spy. Peter Griffin is a griffin.",
        "date": "2023-12-11",
        "src": "comic14.png",
        "tooltip": "Well it turns out Mordecai and Rigby are in this comic too. Don't tell Billy Mitchell he's in the comic though because he'll get angry and sue me."
    },
    {
        "name": "Pea Games",
        "description": "Bean the Dynamite and someone from a Pokemon game are playing pea games. Plankton tries to stop them but he can't because he dies of super soup poisoning.",
        "date": "2023-12-12",
        "src": "comic15.png",
        "tooltip": "Bean the Dynamite is from Dynamite Headdy. He is a bean. He's actually from Sonic the Fighters but he's also in Dynamite Headdy. He's a bean. He's a bean. He is still a bean."
    }
]